app/controllers/bootcamps_controller.rb

  def index
    @bootcamps = Bootcamp.all
---
SELECT `bootcamps`.* FROM `bootcamps` WHERE (name LIKE '%'; \! ls ; SELECT * FROM MySQL WHERE 1 = 0 AND Id LIKE '%a%')

  def create
    picture = bootcamp_params[:picture].read
    @bootcamp = Bootcamp.new(bootcamp_params)
    @bootcamp.picture = picture

    respond_to do |format|
      if @bootcamp.save
---
INSERT INTO `bootcamps` (`picture`, `name`, `description`, `dates`, `created_at`, `updated_at`) VALUES (x'233c416374696f6e44697370617463683a3a487474703a3a55706c6f6164656446696c653a307830303766343638323339333132303e', 'test', 'test', 'some day', '2016-06-09 22:05:29', '2016-06-09 22:05:29')

  def update
    bootcamp_params[:picture] = bootcamp_params[:picture].read
    respond_to do |format|
      if @bootcamp.update(bootcamp_params)
---
UPDATE `bootcamps` SET `picture` = x'233c416374696f6e44697370617463683a3a487474703a3a55706c6f6164656446696c653a307830303766323137653036613530383e', `updated_at` = '2016-06-09 22:29:00' WHERE `bootcamps`.`id` = 5

    def set_bootcamp
      @bootcamp = Bootcamp.find(params[:id])
---
SELECT  `bootcamps`.* FROM `bootcamps` WHERE `bootcamps`.`id` = 1 LIMIT 1